#ifndef HEADER_H_NUM
#define HEADER_H_NUM


    // システム ヘッダ --------------------------------------------------------



    // ローカル ヘッダ --------------------------------------------------------



    // 定数 -------------------------------------------------------------------



    // 構造体 -----------------------------------------------------------------



    // マクロ -----------------------------------------------------------------

#define H_num(val)    ( (Cute) (((val) << 1) | H_NUM_FLAG) )
#define H_num_val(p)  ( (ssize_t) (p)  >> 1 )
#define H_num_inc(p)  ( H_num ( H_num_val(p) + 1 ) )



    // 変数宣言 ---------------------------------------------------------------



    // 関数宣言 ---------------------------------------------------------------

Cute H_num_print( Cute self );
Cute H_num_add( Cute self, Cute p );
Cute H_num_sub( Cute self, Cute p );
Cute H_num_mul( Cute self, Cute p );
Cute H_num_div( Cute self, Cute p );


#endif
